---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUMisbehavingUpdater
source: html/daeb536d-7fbb-8490-c9e5-02283124298d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUMisbehavingUpdater Property

Third party updater '[Name]' has experienced a problem and its action had to be canceled.

## Syntax (C#)
```csharp
public static FailureDefinitionId DUMisbehavingUpdater { get; }
```